Tekla.Structures.DirectManipulation.Adapter.Graphics.NativePolyLineGraphic
The Tekla.Structures.DirectManipulation.Adapter.Graphics.NativePolyLineGraphic class is a Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic for polylines.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativePolyLineGraphic.MaxPolylineSegmentCount
The maximum number of segments that can be drawn as a single polyline.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativePolyLineGraphic.#ctor(System.Collections.Generic.IReadOnlyList{Tekla.Common.Geometry.Segment3},Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineWidth,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineType,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativePolyLineGraphic class.
segments: The segments of the polyline.
color: The color of the graphic.
lineWidth: The line width of the graphic.
lineType: The line type of the graphic.
isSnappable: A value indicating whether the polyline graphic can be snapped to.
drawLightingEffect: A value indicating whether the polyline graphic has the lightinging effect.
useSecondaryColor: A value indicating whether to use the secondary color.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativePolyLineGraphic.Get(System.Collections.Generic.IList{Tekla.Common.Geometry.Segment3},Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineWidth,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineType,System.Boolean,System.Boolean,System.Boolean)
Gets the native lines graphic.
segments: The segments of the lines.
color: The color of the graphic.
lineWidth: The line width of the graphic.
lineType: The line type of the graphic.
isSnappable: A value indicating whether the lines graphic can be snapped to.
drawLightingEffect: A value indicating whether the polyline graphic has the lightinging effect.
useSecondaryColor: A value indicating whether to use the secondary color.
Returns: A new instance of Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeLinesGraphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativePolyLineGraphic.GetPoints
Gets the native points forming the lines graphic.
Returns: The native points forming the lines graphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativePolyLineGraphic.DrawLines(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t@)
Exports the draw temporary polyline command.
argument: The argument.
Returns: Greater than 0 on success.